# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?

a = 1
c = 1
b = (a+c)*2

result = a + b + c
print(f"Петя сделал {a} кораблик, Сережа сделал {c} кораблик, а Катя сделала {b} кораблика. Вместе они сделали {result} корабликов")